app/views/users/index.html.erb

        <h3 class="card-title"><%= link_to gravatar_for(user,size: 150),user_path(user) %></h3>
        <p class="card-text"><%= pluralize(user.articles.count,"article") %></p>
---
SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 2