app/helpers/application_helper.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
	def current_user

		@current_user ||= User.find(session[:user_id]) if session[:user_id]