app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 4)
---
SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles` LIMIT 5 OFFSET 0

  def create
    @article = Article.new(article_params)
    @article.user=current_user

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('leg spin in cricket', 'Leg spin is a type of spin bowling in cricket. A leg spinner bowls right-arm with a wrist spin action. The leg spinner\'s normal delivery causes the ball to spin from right to left (from the bowler\'s perspective) when the ball bounces on the pitch. For a right-handed batsman, that is away from the leg side, and this is where it gets the name leg break.[1]\r\n\r\nLeg spinners bowl mostly leg breaks, varying them by adjusting the line and length, and amount of side spin versus topspin of the deliveries. Leg spinners also typically use variations of flight by sometimes looping the ball in the air, allowing any cross-breeze and the aerodynamic effects of the spinning ball to cause the ball to dip and drift before bouncing and spinning or \"turning\", sharply. Leg spinners also bowl other types of delivery, which spin differently, such as the googly.', '2022-03-14 14:33:18.529409', '2022-03-14 14:33:18.529409', 5)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE `articles` SET `articles`.`description` = 'This is First article.', `articles`.`updated_at` = '2022-03-03 09:55:15.883375' WHERE `articles`.`id` = 1