app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY `articles`.`id` ASC LIMIT 1 OFFSET 0
---
  def index
    @articles = Article.all