app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Traveltomanali', '2022-03-16 11:39:39.491418', '2022-03-16 11:39:39.491418')
---
	def create
		@category = Category.new(category_params)
		if @category.save

SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories`
---
	def index

		@category = Category.paginate(page: params[:page], per_page: 4)