app/controllers/sessions_controller.rb

	def create
		user=User.find_by(email: params[:sessions][:email].downcase)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'demouser@gmail.com' LIMIT 1