app/controllers/users_controller.rb

	def show
		@user=User.find(params[:id])
		@articles=@user.articles.paginate(page: params[:page], per_page: 4)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 2
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 10 LIMIT 5 OFFSET 0

	def index

		@users = User.paginate(page: params[:page], per_page: 4)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 5 OFFSET 0

	def update

		@user=User.find(params[:id])
		if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `users`.`username` = 'Shane Warne', `users`.`email` = 'shanewarne@gmail.com', `users`.`updated_at` = '2022-03-15 06:59:34.728108', `users`.`password_digest` = '$2a$12$jtfTfeZAQwKGMbZyTBJT0OgA6O9wLW.4Bjdb7qobPLCywFm6/AQqm' WHERE `users`.`id` = 5

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Shane Warne', 'shanewarne@gmail.com', '2022-03-15 10:10:04.145951', '2022-03-15 10:10:04.145951', '$2a$12$iz3IkE88qb8CHyJlFWhNb.gHBbW1ThSDj2mAoddsDRoJC9s5WMv86')